results/out/jetty.ring-interceptors.async.java15.ZGC.r10k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 1.714ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.739ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.683ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.799ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.633ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 10.406ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 26.000ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 1.625ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 74.658ms, rate sampling interval: 541ms
  Thread calibration: mean lat.: 75.438ms, rate sampling interval: 530ms
  Thread calibration: mean lat.: 74.498ms, rate sampling interval: 531ms
  Thread calibration: mean lat.: 74.640ms, rate sampling interval: 540ms
  Thread calibration: mean lat.: 73.405ms, rate sampling interval: 531ms
  Thread calibration: mean lat.: 68.871ms, rate sampling interval: 443ms
  Thread calibration: mean lat.: 27.408ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.537ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.98ms   18.74ms   1.01s    99.89%
    Req/Sec   661.64    475.83     3.00k    69.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.74ms
 75.000%    3.31ms
 90.000%    5.37ms
 99.000%    9.32ms
 99.900%   52.48ms
 99.990%  904.70ms
 99.999%  989.18ms
100.000%    1.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.082     0.000000            1         1.00
       0.639     0.100000       590882         1.11
       0.912     0.200000      1180426         1.25
       1.163     0.300000      1771387         1.43
       1.421     0.400000      2360987         1.67
       1.742     0.500000      2950783         2.00
       1.940     0.550000      3244707         2.22
       2.181     0.600000      3540453         2.50
       2.481     0.650000      3834282         2.86
       2.853     0.700000      4129360         3.33
       3.307     0.750000      4424598         4.00
       3.569     0.775000      4572368         4.44
       3.859     0.800000      4719850         5.00
       4.175     0.825000      4866433         5.71
       4.527     0.850000      5014156         6.67
       4.915     0.875000      5162071         8.00
       5.131     0.887500      5236201         8.89
       5.367     0.900000      5309516        10.00
       5.635     0.912500      5383188        11.43
       5.951     0.925000      5456554        13.33
       6.339     0.937500      5529985        16.00
       6.575     0.943750      5567149        17.78
       6.823     0.950000      5604262        20.00
       7.087     0.956250      5640585        22.86
       7.371     0.962500      5677740        26.67
       7.683     0.968750      5714614        32.00
       7.855     0.971875      5732861        35.56
       8.043     0.975000      5751473        40.00
       8.255     0.978125      5770082        45.71
       8.479     0.981250      5788063        53.33
       8.743     0.984375      5806822        64.00
       8.887     0.985938      5816064        71.11
       9.039     0.987500      5825246        80.00
       9.207     0.989062      5834438        91.43
       9.399     0.990625      5843407       106.67
       9.623     0.992188      5852598       128.00
       9.759     0.992969      5857242       142.22
       9.903     0.993750      5861737       160.00
      10.079     0.994531      5866481       182.86
      10.287     0.995313      5871071       213.33
      10.543     0.996094      5875598       256.00
      10.703     0.996484      5877948       284.44
      10.895     0.996875      5880225       320.00
      11.127     0.997266      5882507       365.71
      11.431     0.997656      5884830       426.67
      11.847     0.998047      5887100       512.00
      12.135     0.998242      5888254       568.89
      12.527     0.998437      5889388       640.00
      13.167     0.998633      5890550       731.43
      14.703     0.998828      5891692       853.33
      75.967     0.999023      5892841      1024.00
     166.143     0.999121      5893417      1137.78
     259.327     0.999219      5893995      1280.00
     349.951     0.999316      5894571      1462.86
     443.647     0.999414      5895145      1706.67
     537.087     0.999512      5895723      2048.00
     583.679     0.999561      5896009      2275.56
     628.223     0.999609      5896297      2560.00
     674.303     0.999658      5896590      2925.71
     720.383     0.999707      5896874      3413.33
     765.439     0.999756      5897162      4096.00
     788.479     0.999780      5897308      4551.11
     810.495     0.999805      5897451      5120.00
     834.559     0.999829      5897593      5851.43
     858.623     0.999854      5897737      6826.67
     882.687     0.999878      5897884      8192.00
     893.439     0.999890      5897955      9102.22
     905.215     0.999902      5898025     10240.00
     915.967     0.999915      5898099     11702.86
     925.183     0.999927      5898169     13653.33
     939.519     0.999939      5898242     16384.00
     945.151     0.999945      5898279     18204.44
     949.759     0.999951      5898313     20480.00
     956.415     0.999957      5898350     23405.71
     963.071     0.999963      5898386     27306.67
     966.655     0.999969      5898422     32768.00
     969.215     0.999973      5898443     36408.89
     973.311     0.999976      5898457     40960.00
     977.407     0.999979      5898476     46811.43
     980.479     0.999982      5898495     54613.33
     984.575     0.999985      5898512     65536.00
     985.087     0.999986      5898520     72817.78
     987.135     0.999988      5898532     81920.00
     988.671     0.999989      5898541     93622.86
     989.695     0.999991      5898548    109226.67
     991.231     0.999992      5898556    131072.00
     992.255     0.999993      5898563    145635.56
     992.767     0.999994      5898565    163840.00
     996.351     0.999995      5898572    187245.71
     997.375     0.999995      5898575    218453.33
     998.399     0.999996      5898580    262144.00
     999.423     0.999997      5898583    291271.11
     999.423     0.999997      5898583    327680.00
    1001.471     0.999997      5898589    374491.43
    1001.471     0.999998      5898589    436906.67
    1001.983     0.999998      5898591    524288.00
    1001.983     0.999998      5898591    582542.22
    1002.495     0.999998      5898592    655360.00
    1003.007     0.999999      5898595    748982.86
    1003.007     0.999999      5898595    873813.33
    1004.031     0.999999      5898597   1048576.00
    1004.031     0.999999      5898597   1165084.44
    1004.031     0.999999      5898597   1310720.00
    1005.055     0.999999      5898599   1497965.71
    1005.055     0.999999      5898599   1747626.67
    1005.055     1.000000      5898599   2097152.00
    1005.055     1.000000      5898599   2330168.89
    1005.055     1.000000      5898599   2621440.00
    1006.591     1.000000      5898600   2995931.43
    1006.591     1.000000      5898600   3495253.33
    1006.591     1.000000      5898600   4194304.00
    1006.591     1.000000      5898600   4660337.78
    1006.591     1.000000      5898600   5242880.00
    1007.103     1.000000      5898601   5991862.86
    1007.103     1.000000      5898601          inf
#[Mean    =        2.980, StdDeviation   =       18.736]
#[Max     =     1006.592, Total count    =      5898601]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5995245 requests in 10.00m, 0.93GB read
Requests/sec:   9992.18
Transfer/sec:      1.58MB